zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_SIUL2.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K322_SIUL2.h
 * @version 1.1
 * @date 2022-12-06
 * @brief Peripheral Access Layer for S32K322_SIUL2
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K322_SIUL2_H_)  /* Check if memory map has not been already included */
#define S32K322_SIUL2_H_

#include "S32K322_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SIUL2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIUL2_Peripheral_Access_Layer SIUL2 Peripheral Access Layer
 * @{
 */

/** SIUL2 - Size of Registers Arrays */
#define SIUL2_IFMCR_COUNT                         32u
#define SIUL2_MSCR_COUNT                          155u
#define SIUL2_IMCR_COUNT                          409u
#define SIUL2_MPGPDO_COUNT                        10u

/** SIUL2 - Register Layout Typedef */
typedef struct {
  uint8_t RESERVED_0[4];
  __I  uint32_t MIDR1;                             /**< SIUL2 MCU ID Register #1, offset: 0x4 */
  __I  uint32_t MIDR2;                             /**< SIUL2 MCU ID Register #2, offset: 0x8 */
  uint8_t RESERVED_1[4];
  __IO uint32_t DISR0;                             /**< SIUL2 DMA/Interrupt Status Flag 0, offset: 0x10 */
  uint8_t RESERVED_2[4];
  __IO uint32_t DIRER0;                            /**< SIUL2 DMA/Interrupt Request Enable 0, offset: 0x18 */
  uint8_t RESERVED_3[4];
  __IO uint32_t DIRSR0;                            /**< SIUL2 DMA/Interrupt Request Select 0, offset: 0x20 */
  uint8_t RESERVED_4[4];
  __IO uint32_t IREER0;                            /**< SIUL2 Interrupt Rising-Edge Event Enable 0, offset: 0x28 */
  uint8_t RESERVED_5[4];
  __IO uint32_t IFEER0;                            /**< SIUL2 Interrupt Falling-Edge Event Enable 0, offset: 0x30 */
  uint8_t RESERVED_6[4];
  __IO uint32_t IFER0;                             /**< SIUL2 Interrupt Filter Enable 0, offset: 0x38 */
  uint8_t RESERVED_7[4];
  __IO uint32_t IFMCR[SIUL2_IFMCR_COUNT];          /**< SIUL2 Interrupt Filter Maximum Counter, array offset: 0x40, array step: 0x4 */
  __IO uint32_t IFCPR;                             /**< SIUL2 Interrupt Filter Clock Prescaler, offset: 0xC0 */
  uint8_t RESERVED_8[60];
  __IO uint32_t UDR1;                              /**< SIUL2 User Defined, offset: 0x100 */
  __IO uint32_t UDR0;                              /**< SIUL2 User Defined, offset: 0x104 */
  __IO uint32_t UDR3;                              /**< SIUL2 User Defined, offset: 0x108 */
  __IO uint32_t UDR2;                              /**< SIUL2 User Defined, offset: 0x10C */
  uint8_t RESERVED_9[240];
  __I  uint32_t MIDR3;                             /**< SIUL2 MCU ID Register #3, offset: 0x200 */
  __I  uint32_t MIDR4;                             /**< SIUL2 MCU ID Register #4, offset: 0x204 */
  uint8_t RESERVED_10[56];
  __IO uint32_t MSCR[SIUL2_MSCR_COUNT];            /**< SIUL2 Multiplexed Signal Configuration, array offset: 0x240, array step: 0x4 */
  uint8_t RESERVED_11[1428];
  __IO uint32_t IMCR[SIUL2_IMCR_COUNT];            /**< SIUL2 Input Multiplexed Signal Configuration, array offset: 0xA40, array step: 0x4 */
  uint8_t RESERVED_12[604];
  __IO uint8_t GPDO3;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1300 */
  __IO uint8_t GPDO2;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1301 */
  __IO uint8_t GPDO1;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1302 */
  __IO uint8_t GPDO0;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1303 */
  __IO uint8_t GPDO7;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1304 */
  __IO uint8_t GPDO6;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1305 */
  __IO uint8_t GPDO5;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1306 */
  __IO uint8_t GPDO4;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x1307 */
  __IO uint8_t GPDO11;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1308 */
  __IO uint8_t GPDO10;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1309 */
  __IO uint8_t GPDO9;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x130A */
  __IO uint8_t GPDO8;                              /**< SIUL2 GPIO Pad Data Output, offset: 0x130B */
  __IO uint8_t GPDO15;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x130C */
  __IO uint8_t GPDO14;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x130D */
  __IO uint8_t GPDO13;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x130E */
  __IO uint8_t GPDO12;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x130F */
  __IO uint8_t GPDO19;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1310 */
  __IO uint8_t GPDO18;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1311 */
  __IO uint8_t GPDO17;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1312 */
  __IO uint8_t GPDO16;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1313 */
  uint8_t RESERVED_13[2];
  __IO uint8_t GPDO21;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1316 */
  __IO uint8_t GPDO20;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1317 */
  __IO uint8_t GPDO27;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1318 */
  __IO uint8_t GPDO26;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1319 */
  __IO uint8_t GPDO25;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131A */
  __IO uint8_t GPDO24;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131B */
  __IO uint8_t GPDO31;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131C */
  __IO uint8_t GPDO30;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131D */
  __IO uint8_t GPDO29;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131E */
  __IO uint8_t GPDO28;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x131F */
  __IO uint8_t GPDO35;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1320 */
  __IO uint8_t GPDO34;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1321 */
  __IO uint8_t GPDO33;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1322 */
  __IO uint8_t GPDO32;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1323 */
  uint8_t RESERVED_14[2];
  __IO uint8_t GPDO37;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1326 */
  __IO uint8_t GPDO36;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1327 */
  __IO uint8_t GPDO43;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1328 */
  __IO uint8_t GPDO42;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1329 */
  __IO uint8_t GPDO41;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132A */
  __IO uint8_t GPDO40;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132B */
  __IO uint8_t GPDO47;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132C */
  __IO uint8_t GPDO46;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132D */
  __IO uint8_t GPDO45;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132E */
  __IO uint8_t GPDO44;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x132F */
  __IO uint8_t GPDO51;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1330 */
  __IO uint8_t GPDO50;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1331 */
  __IO uint8_t GPDO49;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1332 */
  __IO uint8_t GPDO48;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1333 */
  __IO uint8_t GPDO55;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1334 */
  __IO uint8_t GPDO54;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1335 */
  __IO uint8_t GPDO53;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1336 */
  __IO uint8_t GPDO52;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1337 */
  __IO uint8_t GPDO59;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1338 */
  __IO uint8_t GPDO58;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1339 */
  __IO uint8_t GPDO57;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x133A */
  __IO uint8_t GPDO56;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x133B */
  uint8_t RESERVED_15[2];
  __IO uint8_t GPDO61;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x133E */
  __IO uint8_t GPDO60;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x133F */
  __IO uint8_t GPDO67;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1340 */
  __IO uint8_t GPDO66;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1341 */
  __IO uint8_t GPDO65;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1342 */
  __IO uint8_t GPDO64;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1343 */
  __IO uint8_t GPDO71;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1344 */
  __IO uint8_t GPDO70;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1345 */
  __IO uint8_t GPDO69;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1346 */
  __IO uint8_t GPDO68;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1347 */
  __IO uint8_t GPDO75;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1348 */
  __IO uint8_t GPDO74;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1349 */
  __IO uint8_t GPDO73;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134A */
  __IO uint8_t GPDO72;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134B */
  __IO uint8_t GPDO79;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134C */
  __IO uint8_t GPDO78;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134D */
  __IO uint8_t GPDO77;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134E */
  __IO uint8_t GPDO76;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x134F */
  __IO uint8_t GPDO83;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1350 */
  __IO uint8_t GPDO82;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1351 */
  __IO uint8_t GPDO81;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1352 */
  __IO uint8_t GPDO80;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1353 */
  __IO uint8_t GPDO87;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1354 */
  uint8_t RESERVED_16[1];
  __IO uint8_t GPDO85;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1356 */
  __IO uint8_t GPDO84;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1357 */
  __IO uint8_t GPDO91;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1358 */
  __IO uint8_t GPDO90;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1359 */
  __IO uint8_t GPDO89;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135A */
  __IO uint8_t GPDO88;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135B */
  __IO uint8_t GPDO95;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135C */
  __IO uint8_t GPDO94;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135D */
  __IO uint8_t GPDO93;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135E */
  __IO uint8_t GPDO92;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x135F */
  __IO uint8_t GPDO99;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1360 */
  __IO uint8_t GPDO98;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1361 */
  __IO uint8_t GPDO97;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1362 */
  __IO uint8_t GPDO96;                             /**< SIUL2 GPIO Pad Data Output, offset: 0x1363 */
  __IO uint8_t GPDO103;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1364 */
  __IO uint8_t GPDO102;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1365 */
  __IO uint8_t GPDO101;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1366 */
  __IO uint8_t GPDO100;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1367 */
  __IO uint8_t GPDO107;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1368 */
  __IO uint8_t GPDO106;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1369 */
  __IO uint8_t GPDO105;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136A */
  __IO uint8_t GPDO104;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136B */
  __IO uint8_t GPDO111;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136C */
  __IO uint8_t GPDO110;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136D */
  __IO uint8_t GPDO109;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136E */
  __IO uint8_t GPDO108;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x136F */
  uint8_t RESERVED_17[2];
  __IO uint8_t GPDO113;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1372 */
  __IO uint8_t GPDO112;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1373 */
  __IO uint8_t GPDO119;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1374 */
  __IO uint8_t GPDO118;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1375 */
  __IO uint8_t GPDO117;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1376 */
  __IO uint8_t GPDO116;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1377 */
  __IO uint8_t GPDO123;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1378 */
  __IO uint8_t GPDO122;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1379 */
  uint8_t RESERVED_18[1];
  __IO uint8_t GPDO120;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x137B */
  __IO uint8_t GPDO127;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x137C */
  __IO uint8_t GPDO126;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x137D */
  __IO uint8_t GPDO125;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x137E */
  __IO uint8_t GPDO124;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x137F */
  __IO uint8_t GPDO131;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1380 */
  __IO uint8_t GPDO130;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1381 */
  __IO uint8_t GPDO129;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1382 */
  __IO uint8_t GPDO128;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1383 */
  __IO uint8_t GPDO135;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1384 */
  __IO uint8_t GPDO134;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1385 */
  __IO uint8_t GPDO133;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1386 */
  __IO uint8_t GPDO132;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1387 */
  __IO uint8_t GPDO139;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1388 */
  __IO uint8_t GPDO138;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1389 */
  __IO uint8_t GPDO137;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138A */
  __IO uint8_t GPDO136;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138B */
  __IO uint8_t GPDO143;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138C */
  __IO uint8_t GPDO142;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138D */
  __IO uint8_t GPDO141;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138E */
  __IO uint8_t GPDO140;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x138F */
  uint8_t RESERVED_19[1];
  __IO uint8_t GPDO146;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1391 */
  __IO uint8_t GPDO145;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1392 */
  __IO uint8_t GPDO144;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1393 */
  __IO uint8_t GPDO151;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1394 */
  __IO uint8_t GPDO150;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1395 */
  __IO uint8_t GPDO149;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1396 */
  uint8_t RESERVED_20[2];
  __IO uint8_t GPDO154;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x1399 */
  __IO uint8_t GPDO153;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x139A */
  __IO uint8_t GPDO152;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x139B */
  uint8_t RESERVED_21[356];
  __I  uint8_t GPDI3;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1500 */
  __I  uint8_t GPDI2;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1501 */
  __I  uint8_t GPDI1;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1502 */
  __I  uint8_t GPDI0;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1503 */
  __I  uint8_t GPDI7;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1504 */
  __I  uint8_t GPDI6;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1505 */
  __I  uint8_t GPDI5;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1506 */
  __I  uint8_t GPDI4;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1507 */
  __I  uint8_t GPDI11;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1508 */
  __I  uint8_t GPDI10;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1509 */
  __I  uint8_t GPDI9;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x150A */
  __I  uint8_t GPDI8;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x150B */
  __I  uint8_t GPDI15;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150C */
  __I  uint8_t GPDI14;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150D */
  __I  uint8_t GPDI13;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150E */
  __I  uint8_t GPDI12;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150F */
  __I  uint8_t GPDI19;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1510 */
  __I  uint8_t GPDI18;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1511 */
  __I  uint8_t GPDI17;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1512 */
  __I  uint8_t GPDI16;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1513 */
  uint8_t RESERVED_22[2];
  __I  uint8_t GPDI21;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1516 */
  __I  uint8_t GPDI20;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1517 */
  __I  uint8_t GPDI27;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1518 */
  __I  uint8_t GPDI26;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1519 */
  __I  uint8_t GPDI25;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151A */
  __I  uint8_t GPDI24;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151B */
  __I  uint8_t GPDI31;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151C */
  __I  uint8_t GPDI30;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151D */
  __I  uint8_t GPDI29;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151E */
  __I  uint8_t GPDI28;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151F */
  __I  uint8_t GPDI35;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1520 */
  __I  uint8_t GPDI34;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1521 */
  __I  uint8_t GPDI33;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1522 */
  __I  uint8_t GPDI32;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1523 */
  uint8_t RESERVED_23[2];
  __I  uint8_t GPDI37;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1526 */
  __I  uint8_t GPDI36;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1527 */
  __I  uint8_t GPDI43;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1528 */
  __I  uint8_t GPDI42;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1529 */
  __I  uint8_t GPDI41;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152A */
  __I  uint8_t GPDI40;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152B */
  __I  uint8_t GPDI47;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152C */
  __I  uint8_t GPDI46;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152D */
