zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_SIUL2.h
#define SIUL2_UDR2_UDR0_MASK                     (0x1U)
#define SIUL2_UDR2_UDR0_SHIFT                    (0U)
#define SIUL2_UDR2_UDR0_WIDTH                    (1U)
#define SIUL2_UDR2_UDR0(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR0_SHIFT)) & SIUL2_UDR2_UDR0_MASK)

#define SIUL2_UDR2_UDR1_MASK                     (0x2U)
#define SIUL2_UDR2_UDR1_SHIFT                    (1U)
#define SIUL2_UDR2_UDR1_WIDTH                    (1U)
#define SIUL2_UDR2_UDR1(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR1_SHIFT)) & SIUL2_UDR2_UDR1_MASK)

#define SIUL2_UDR2_UDR2_MASK                     (0x4U)
#define SIUL2_UDR2_UDR2_SHIFT                    (2U)
#define SIUL2_UDR2_UDR2_WIDTH                    (1U)
#define SIUL2_UDR2_UDR2(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR2_SHIFT)) & SIUL2_UDR2_UDR2_MASK)

#define SIUL2_UDR2_UDR3_MASK                     (0x8U)
#define SIUL2_UDR2_UDR3_SHIFT                    (3U)
#define SIUL2_UDR2_UDR3_WIDTH                    (1U)
#define SIUL2_UDR2_UDR3(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR3_SHIFT)) & SIUL2_UDR2_UDR3_MASK)

#define SIUL2_UDR2_UDR4_MASK                     (0x10U)
#define SIUL2_UDR2_UDR4_SHIFT                    (4U)
#define SIUL2_UDR2_UDR4_WIDTH                    (1U)
#define SIUL2_UDR2_UDR4(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR4_SHIFT)) & SIUL2_UDR2_UDR4_MASK)

#define SIUL2_UDR2_UDR5_MASK                     (0x20U)
#define SIUL2_UDR2_UDR5_SHIFT                    (5U)
#define SIUL2_UDR2_UDR5_WIDTH                    (1U)
#define SIUL2_UDR2_UDR5(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR5_SHIFT)) & SIUL2_UDR2_UDR5_MASK)

#define SIUL2_UDR2_UDR6_MASK                     (0x40U)
#define SIUL2_UDR2_UDR6_SHIFT                    (6U)
#define SIUL2_UDR2_UDR6_WIDTH                    (1U)
#define SIUL2_UDR2_UDR6(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR6_SHIFT)) & SIUL2_UDR2_UDR6_MASK)

#define SIUL2_UDR2_UDR7_MASK                     (0x80U)
#define SIUL2_UDR2_UDR7_SHIFT                    (7U)
#define SIUL2_UDR2_UDR7_WIDTH                    (1U)
#define SIUL2_UDR2_UDR7(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR7_SHIFT)) & SIUL2_UDR2_UDR7_MASK)

#define SIUL2_UDR2_UDR8_MASK                     (0x100U)
#define SIUL2_UDR2_UDR8_SHIFT                    (8U)
#define SIUL2_UDR2_UDR8_WIDTH                    (1U)
#define SIUL2_UDR2_UDR8(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR8_SHIFT)) & SIUL2_UDR2_UDR8_MASK)

#define SIUL2_UDR2_UDR9_MASK                     (0x200U)
#define SIUL2_UDR2_UDR9_SHIFT                    (9U)
#define SIUL2_UDR2_UDR9_WIDTH                    (1U)
#define SIUL2_UDR2_UDR9(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR9_SHIFT)) & SIUL2_UDR2_UDR9_MASK)

#define SIUL2_UDR2_UDR10_MASK                    (0x400U)
#define SIUL2_UDR2_UDR10_SHIFT                   (10U)
#define SIUL2_UDR2_UDR10_WIDTH                   (1U)
#define SIUL2_UDR2_UDR10(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR10_SHIFT)) & SIUL2_UDR2_UDR10_MASK)

#define SIUL2_UDR2_UDR11_MASK                    (0x800U)
#define SIUL2_UDR2_UDR11_SHIFT                   (11U)
#define SIUL2_UDR2_UDR11_WIDTH                   (1U)
#define SIUL2_UDR2_UDR11(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR11_SHIFT)) & SIUL2_UDR2_UDR11_MASK)

#define SIUL2_UDR2_UDR12_MASK                    (0x1000U)
#define SIUL2_UDR2_UDR12_SHIFT                   (12U)
#define SIUL2_UDR2_UDR12_WIDTH                   (1U)
#define SIUL2_UDR2_UDR12(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR12_SHIFT)) & SIUL2_UDR2_UDR12_MASK)

#define SIUL2_UDR2_UDR13_MASK                    (0x2000U)
#define SIUL2_UDR2_UDR13_SHIFT                   (13U)
#define SIUL2_UDR2_UDR13_WIDTH                   (1U)
#define SIUL2_UDR2_UDR13(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR13_SHIFT)) & SIUL2_UDR2_UDR13_MASK)

#define SIUL2_UDR2_UDR14_MASK                    (0x4000U)
#define SIUL2_UDR2_UDR14_SHIFT                   (14U)
#define SIUL2_UDR2_UDR14_WIDTH                   (1U)
#define SIUL2_UDR2_UDR14(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR14_SHIFT)) & SIUL2_UDR2_UDR14_MASK)

#define SIUL2_UDR2_UDR15_MASK                    (0x8000U)
#define SIUL2_UDR2_UDR15_SHIFT                   (15U)
#define SIUL2_UDR2_UDR15_WIDTH                   (1U)
#define SIUL2_UDR2_UDR15(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR15_SHIFT)) & SIUL2_UDR2_UDR15_MASK)

#define SIUL2_UDR2_UDR16_MASK                    (0x10000U)
#define SIUL2_UDR2_UDR16_SHIFT                   (16U)
#define SIUL2_UDR2_UDR16_WIDTH                   (1U)
#define SIUL2_UDR2_UDR16(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR16_SHIFT)) & SIUL2_UDR2_UDR16_MASK)

#define SIUL2_UDR2_UDR17_MASK                    (0x20000U)
#define SIUL2_UDR2_UDR17_SHIFT                   (17U)
#define SIUL2_UDR2_UDR17_WIDTH                   (1U)
#define SIUL2_UDR2_UDR17(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR17_SHIFT)) & SIUL2_UDR2_UDR17_MASK)

#define SIUL2_UDR2_UDR18_MASK                    (0x40000U)
#define SIUL2_UDR2_UDR18_SHIFT                   (18U)
#define SIUL2_UDR2_UDR18_WIDTH                   (1U)
#define SIUL2_UDR2_UDR18(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR18_SHIFT)) & SIUL2_UDR2_UDR18_MASK)

#define SIUL2_UDR2_UDR19_MASK                    (0x80000U)
#define SIUL2_UDR2_UDR19_SHIFT                   (19U)
#define SIUL2_UDR2_UDR19_WIDTH                   (1U)
#define SIUL2_UDR2_UDR19(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR19_SHIFT)) & SIUL2_UDR2_UDR19_MASK)

#define SIUL2_UDR2_UDR20_MASK                    (0x100000U)
#define SIUL2_UDR2_UDR20_SHIFT                   (20U)
#define SIUL2_UDR2_UDR20_WIDTH                   (1U)
#define SIUL2_UDR2_UDR20(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR20_SHIFT)) & SIUL2_UDR2_UDR20_MASK)

#define SIUL2_UDR2_UDR21_MASK                    (0x200000U)
#define SIUL2_UDR2_UDR21_SHIFT                   (21U)
#define SIUL2_UDR2_UDR21_WIDTH                   (1U)
#define SIUL2_UDR2_UDR21(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR21_SHIFT)) & SIUL2_UDR2_UDR21_MASK)

#define SIUL2_UDR2_UDR22_MASK                    (0x400000U)
#define SIUL2_UDR2_UDR22_SHIFT                   (22U)
#define SIUL2_UDR2_UDR22_WIDTH                   (1U)
#define SIUL2_UDR2_UDR22(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR22_SHIFT)) & SIUL2_UDR2_UDR22_MASK)

#define SIUL2_UDR2_UDR23_MASK                    (0x800000U)
#define SIUL2_UDR2_UDR23_SHIFT                   (23U)
#define SIUL2_UDR2_UDR23_WIDTH                   (1U)
#define SIUL2_UDR2_UDR23(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR23_SHIFT)) & SIUL2_UDR2_UDR23_MASK)

#define SIUL2_UDR2_UDR24_MASK                    (0x1000000U)
#define SIUL2_UDR2_UDR24_SHIFT                   (24U)
#define SIUL2_UDR2_UDR24_WIDTH                   (1U)
#define SIUL2_UDR2_UDR24(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR24_SHIFT)) & SIUL2_UDR2_UDR24_MASK)

#define SIUL2_UDR2_UDR25_MASK                    (0x2000000U)
#define SIUL2_UDR2_UDR25_SHIFT                   (25U)
#define SIUL2_UDR2_UDR25_WIDTH                   (1U)
#define SIUL2_UDR2_UDR25(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR25_SHIFT)) & SIUL2_UDR2_UDR25_MASK)

